; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	thermograph1 - mode
	spectrograph2 - mode
	spectrograph0 - mode
	GroundStation3 - direction
	GroundStation5 - direction
	Star7 - direction
	GroundStation12 - direction
	GroundStation8 - direction
	GroundStation1 - direction
	Star10 - direction
	Star13 - direction
	Star14 - direction
	Star11 - direction
	GroundStation9 - direction
	GroundStation0 - direction
	Star4 - direction
	Star2 - direction
	GroundStation6 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 GroundStation9)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 Star14)
	(calibration_target instrument2 Star13)
	(calibration_target instrument2 Star10)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star18)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star14)
)
(:goal (and
	(pointing satellite3 GroundStation12)
	(have_image Planet15 spectrograph2)
	(have_image Phenomenon16 thermograph1)
	(have_image Planet17 thermograph1)
	(have_image Star18 spectrograph2)
	(have_image Star19 spectrograph0)
	(have_image Planet20 spectrograph0)
	(have_image Star21 spectrograph0)
))

)

; plan
1. (turn_to satellite3 groundstation0 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 groundstation0)
   goals met: 0 of 8
2. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite3 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite3 planet17 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet17)
   goals met: 0 of 8
5. (take_image satellite3 planet17 instrument3 thermograph1)
   added: (have_image planet17 thermograph1)
   goals met: 1 of 8
6. (turn_to satellite3 planet15 planet17)
   deleted: (pointing satellite3 planet17)
   added: (pointing satellite3 planet15)
   goals met: 1 of 8
7. (take_image satellite3 planet15 instrument3 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 2 of 8
8. (turn_to satellite3 phenomenon16 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 phenomenon16)
   goals met: 2 of 8
9. (take_image satellite3 phenomenon16 instrument3 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 3 of 8
10. (turn_to satellite3 planet20 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 planet20)
   goals met: 3 of 8
11. (take_image satellite3 planet20 instrument3 spectrograph0)
   added: (have_image planet20 spectrograph0)
   goals met: 4 of 8
12. (turn_to satellite3 star18 planet20)
   deleted: (pointing satellite3 planet20)
   added: (pointing satellite3 star18)
   goals met: 4 of 8
13. (take_image satellite3 star18 instrument3 spectrograph2)
   added: (have_image star18 spectrograph2)
   goals met: 5 of 8
14. (turn_to satellite3 star19 star18)
   deleted: (pointing satellite3 star18)
   added: (pointing satellite3 star19)
   goals met: 5 of 8
15. (take_image satellite3 star19 instrument3 spectrograph0)
   added: (have_image star19 spectrograph0)
   goals met: 6 of 8
16. (turn_to satellite3 star21 star19)
   deleted: (pointing satellite3 star19)
   added: (pointing satellite3 star21)
   goals met: 6 of 8
17. (take_image satellite3 star21 instrument3 spectrograph0)
   added: (have_image star21 spectrograph0)
   goals met: 7 of 8
18. (turn_to satellite3 groundstation12 star21)
   deleted: (pointing satellite3 star21)
   added: (pointing satellite3 groundstation12)
   goals met: 8 of 8
